many_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "Tabby"], ["updated_at", "2018-09-11 23:42:03.198321"], ["id", 4]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)